Catalogs/ТТМ_ГрафическиеСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТТМ_ГрафическиеСхемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ТТМ_РегистрГрафическиеСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТМ_РегистрГрафическиеСхемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФайлДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрафическаяСхема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТМ_ГрафическиеСхемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ТТМ_ГрафическиеСхемы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГрафСхема = РегистрыСведений.ТТМ_РегистрГрафическиеСхемы.СоздатьМенеджерЗаписи();
	ГрафСхема.ГрафическаяСхема = Объект.Ссылка;
	ГрафСхема.Прочитать();
	
	Если ГрафСхема.Выбран() Тогда
		ЗагруженнаяСхема = ГрафСхема.ФайлДанных.Получить();
		ГрафическаяСхема = ЗагруженнаяСхема;
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ЗагруженнаяСхема, ЭтаФорма.УникальныйИдентификатор);
		Объект.АдресВХранилище = АдресВоВременномХранилище;
		Объект.ДатаИзменения = ГрафСхема.ДатаИзменения;
		Объект.Ответственный = ГрафСхема.Ответственный;
		Объект.Комментарий = ГрафСхема.Комментарий;
	Иначе
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
		Объект.ДатаИзменения = ПолучитьТекущуюДатуСеанса();
	КонецЕсли;
	
	ЗафиксированыИзменения = Ложь;
	ТолькоЧтение = Истина;
	Элементы.ФайлВыбран.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГрафическаяСхемаПриИзменении(Элемент)
	ПриИзмененииОбъектаСодержимого();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.АдресВХранилище = ""  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Схема отсутствует или не была заполнена'"),, "ГрафическаяСхема");
		Возврат;
	КонецЕсли;
	
	ОбъектХранилища  = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Объект.АдресВХранилище));
	НоваяЗапись = РегистрыСведений.ТТМ_РегистрГрафическиеСхемы.СоздатьМенеджерЗаписи();
	НоваяЗапись.ГрафическаяСхема = ТекущийОбъект.Ссылка;
	НоваяЗапись.ФайлДанных = ОбъектХранилища;
	НоваяЗапись.ДатаИзменения = Объект.ДатаИзменения;
	НоваяЗапись.Ответственный = Объект.Ответственный;
	НоваяЗапись.Комментарий = Объект.Комментарий;
	
	Попытка
		НачатьТранзакцию();		
		НоваяЗапись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка при записи'") + ОписаниеОшибки());
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ПодтверждениеОЗакрытии Или ЗафиксированыИзменения Или ТолькоЧтение Тогда
		Возврат;
	КонецЕсли;
		
	ТекстПредупреждения = "При закрытии формы все данные будут утеряны. Продолжить?";
	
	Если Не ЗавершениеРаботы Тогда
		Отказ = Истина;
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗакрытии, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет, 0,, "Графические схемы");
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(ОтветПользователя, ДополнительныеПараметры) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПодтверждениеОЗакрытии = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДатаИзменения = ПолучитьТекущуюДатуСеанса();
	Объект.Ответственный = ПользователиКлиент.АвторизованныйПользователь();
КонецПроцедуры

 &НаКлиенте
Процедура ПриИзмененииОбъектаСодержимого()
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ГрафическаяСхема, ЭтаФорма.УникальныйИдентификатор);	
	Объект.АдресВХранилище =  АдресВоВременномХранилище;
	Объект.Ответственный = ПользователиКлиент.АвторизованныйПользователь();
	
	ТолькоЧтение = Ложь;
	ЗафиксированыИзменения = Истина;
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////
#Область ЗагрузкаФайла

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл графической схемы";
	Проводник.Фильтр ="Графическая схема (*.grs) | *.grs";
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	ТекущийФормат = СтрНайти(Объект.ПутьКФайлу, ".grs", НаправлениеПоиска.СКонца);
	
	Если ТекущийФормат = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поддерживается только формат .grs'"),, "Объект.ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	ГрафСхема = Новый ГрафическаяСхема;
	ГрафСхема.Прочитать(Объект.ПутьКФайлу);
	
	ГрафическаяСхема = ГрафСхема;
	Элементы.ФайлВыбран.Видимость = Истина;
	ПриИзмененииОбъектаСодержимого();
КонецПроцедуры

#КонецОбласти
